---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.GuideGridSpacingParam
source: html/a2a3b849-f906-5f0b-408e-0563b5b27444.htm
---
# Autodesk.Revit.DB.ParameterTypeId.GuideGridSpacingParam Property

"Guide Spacing"

## Syntax (C#)
```csharp
public static ForgeTypeId GuideGridSpacingParam { get; }
```